000_РОЗНИЦА_ЦЕНТР/src/DataProcessors/РезультатыАнкетирования/РезультатыАнкетирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РезультатыАнкетирования</name>
  <tabularSections>
    <name>ВходящиеДанные</name>
    <attributes>
      <name>Пометка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерКарты</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Фамилия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отчество</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПолКонтрагента</name>
      <type>
        <types>EnumRef.ПолФизическогоЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРожденияКонтрагента</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>800</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Телефон</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Электропочта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРебенка_1</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРожденияРебенка_1</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПолРебенка_1</name>
      <type>
        <types>EnumRef.ПолФизическогоЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРебенка_2</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРожденияРебенка_2</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПолРебенка_2</name>
      <type>
        <types>EnumRef.ПолФизическогоЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРебенка_3</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРожденияРебенка_3</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПолРебенка_3</name>
      <type>
        <types>EnumRef.ПолФизическогоЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерМагазина</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВыдачиКарты</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШБМ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДанныеАдрес</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДанныеТелефон</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИнформационнаяКарта</name>
      <type>
        <types>CatalogRef.ИнформационныеКарты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДисконтнойКарты</name>
      <type>
        <types>CatalogRef.ВидыДисконтныхКарт</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтрагентПоНомеруТелефона</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Магазин</name>
      <type>
        <types>CatalogRef.Магазины</types>
      </type>
    </attributes>
    <attributes>
      <name>Индекс</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Область</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Район</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Улица</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дом</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Корпус</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Квартира</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Применено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяЭквивалент</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРебенкаЭквивалент_1</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРебенкаЭквивалент_2</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРебенкаЭквивалент_3</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ФИОФизЛиц/ФИОФизЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ФИОФизЛиц</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Фамилия</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Имя</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Отчество</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ФизЛицо</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Enums/СобытияВерификацииПокупателей/СобытияВерификацииПокупателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СобытияВерификацииПокупателей</name>
  <enumValues>
    <name>Выполнено</name>
  </enumValues>
  <enumValues>
    <name>ОтказПокупателя</name>
  </enumValues>
  <enumValues>
    <name>Отложено</name>
    <comment>Отложено сотрудником магазина</comment>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Enums/ЮрФизЛицо/ЮрФизЛицо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЮрФизЛицо</name>
  <comment>Определяет, является ли организация или контрагент юридическим лицом или нет.</comment>
  <enumValues>
    <name>ЮрЛицо</name>
  </enumValues>
  <enumValues>
    <name>ФизЛицо</name>
  </enumValues>
  <enumValues>
    <name>ЮрЛицоНеРезидент</name>
  </enumValues>
  <enumValues>
    <name>ИндивидуальныйПредприниматель</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/DataProcessors/РезультатыАнкетирования/ObjectModule.bsl
Процедура ПрименитьПолученныеДанные()	Экспорт

	УстановитьПривилегированныйРежим(Истина);

	ЖурналСобытий.Регистрация("РезультатыАнкетирования.Применение", "Примечание"
	,,,, "4. Начало записи.", ИмяКомпьютера(), Истина);

	Счётчик = 0;

	Для каждого СтрокаТабличнойЧасти Из ВходящиеДанные Цикл

		Если НЕ СтрокаТабличнойЧасти.Пометка Тогда

			Продолжить;

		КонецЕсли;

		Если НЕ КонтактнаяИнформацияКлиентСервер.ДанныеАнкетыПрименимы(СтрокаТабличнойЧасти) Тогда

			СтрокаТабличнойЧасти.Пометка = Ложь;
			Продолжить;

		КонецЕсли;

		НачатьТранзакцию();

		Попытка

			УстановитьДанныеКонтрагента(СтрокаТабличнойЧасти);
			ВерификацияКлиентовСервер.УстановитьДанныеИнформационнойКарты(СтрокаТабличнойЧасти);

			ВерификацияКлиентовСервер.УстановитьСобытиеВерификации(
				СтрокаТабличнойЧасти.Контрагент,
				СтрокаТабличнойЧасти.ИнформационнаяКарта,
				Перечисления.СобытияВерификацииПокупателей.Выполнено,
				СтрокаТабличнойЧасти.ДатаВыдачиКарты
			);

			СтрокаТабличнойЧасти.Применено = Истина;
			Счётчик = Счётчик + 1;

			ЗафиксироватьТранзакцию();
	
		Исключение

			ТекстОшибки = ОписаниеОшибки();
			ОтменитьТранзакцию();

			ЖурналСобытий.Регистрация("РезультатыАнкетирования.Применение", "Ошибка"
			,,,, "4.1. Ошибка (" + Формат(Счётчик, "ЧДЦ=; ЧН=0; ЧГ=") + " эл.):" + Символы.ПС + ТекстОшибки, ИмяКомпьютера(), Ложь);

			ВызватьИсключение "ОШИБКА СИСТЕМЫ:" + Символы.ПС + ТекстОшибки;

		КонецПопытки;

	КонецЦикла;

	ЖурналСобытий.Регистрация("РезультатыАнкетирования.Применение", "Примечание"
	,,,, "5. Запись завершена. Всего записано " + Формат(Счётчик, "ЧДЦ=; ЧН=0; ЧГ=") + " эл.", ИмяКомпьютера(), Истина);

КонецПроцедуры

Процедура УстановитьДанныеКонтрагента(СтрокаТабличнойЧасти)

	Если НЕ СтрокаТабличнойЧасти.Контрагент.Пустая() Тогда

		КонтрагентОбъект = СтрокаТабличнойЧасти.Контрагент.ПолучитьОбъект();

		Если ПустаяСтрока(КонтрагентОбъект.IDN) Тогда

			КонтрагентОбъект.IDN = КонтрагентОбъект.Код;

		КонецЕсли;

	Иначе

		КонтрагентОбъект = Справочники.Контрагенты.СоздатьЭлемент();
		КонтрагентОбъект.УстановитьНовыйКод();
		КонтрагентОбъект.IDN = КонтрагентОбъект.Код;
		КонтрагентОбъект.Родитель = Справочники.Контрагенты.Покупатели;

		КонтрагентОбъект.УстановитьСсылкуНового(Справочники.Контрагенты.ПолучитьСсылку());
		СтрокаТабличнойЧасти.Контрагент = КонтрагентОбъект.ПолучитьСсылкуНового();

	КонецЕсли;

	КонтрагентОбъект.Покупатель      = Истина;
	КонтрагентОбъект.ПометкаУдаления = Ложь;
	КонтрагентОбъект.ЮрФизЛицо    = Перечисления.ЮрФизЛицо.ФизЛицо;
	КонтрагентОбъект.Пол          = СтрокаТабличнойЧасти.ПолКонтрагента;
	КонтрагентОбъект.ДатаРождения = СтрокаТабличнойЧасти.ДатаРожденияКонтрагента;
//	---------------------------------------------------------------------------------------

	СтроковыеФункцииКлиентСервер.ПривестиНаименование(СтрокаТабличнойЧасти.Фамилия, Истина, Истина);
	СтроковыеФункцииКлиентСервер.ПривестиНаименование(СтрокаТабличнойЧасти.Имя, Истина, Истина);
	СтроковыеФункцииКлиентСервер.ПривестиНаименование(СтрокаТабличнойЧасти.Отчество, Истина, Истина);

//	Выполним минимальную нормализацию наименования..
	КонтрагентОбъект.Наименование = СтроковыеФункцииКлиентСервер.ПривестиНаименование(
		СтрокаТабличнойЧасти.Фамилия + " " + СтрокаТабличнойЧасти.Имя + " " + СтрокаТабличнойЧасти.Отчество
		, Ложь, Истина
	);
	КонтрагентОбъект.НаименованиеПолное = КонтрагентОбъект.Наименование;

	ДатаСеансаТекущая = ТекущаяДатаСеанса();

	СтруктураЗаписи = РегистрыСведений.ФИОФизЛиц.ПолучитьПоследнее(ДатаСеансаТекущая, Новый Структура("ФизЛицо", СтрокаТабличнойЧасти.Контрагент));

	Если 	НЕ СтруктураЗаписи.Фамилия = СтрокаТабличнойЧасти.Фамилия
		ИЛИ НЕ СтруктураЗаписи.Отчество = СтрокаТабличнойЧасти.Отчество
		ИЛИ НЕ СтруктураЗаписи.Имя = СтрокаТабличнойЧасти.Имя Тогда

		МенеджерЗаписи = РегистрыСведений.ФИОФизЛиц.СоздатьМенеджерЗаписи();

		МенеджерЗаписи.ФизЛицо  = СтрокаТабличнойЧасти.Контрагент;
		МенеджерЗаписи.Период   = ДатаСеансаТекущая;
		МенеджерЗаписи.Фамилия  = СтрокаТабличнойЧасти.Фамилия;
		МенеджерЗаписи.Имя      = СтрокаТабличнойЧасти.Имя;
		МенеджерЗаписи.Отчество = СтрокаТабличнойЧасти.Отчество;

		МенеджерЗаписи.Записать(Истина);

	КонецЕсли;

//	ТЕЛЕФОН
//	---------------------------------------------------------------------------------------
	СтрокаКонтакта = КонтактнаяИнформацияСлужебный.ПолучитьСтрокуКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента, КонтрагентОбъект.КонтактнаяИнформация);

	Если ПустаяСтрока(СтрокаТабличнойЧасти.Телефон) Тогда

		КонтрагентОбъект.КонтактнаяИнформация.Удалить(КонтрагентОбъект.КонтактнаяИнформация.Индекс(СтрокаКонтакта));

	Иначе

		СтрокаКонтакта.Представление = СокрЛП(СтрокаТабличнойЧасти.Телефон);
		СтрокаКонтакта.НомерТелефона = СокрЛП(СтрокаТабличнойЧасти.Телефон);
		СтрокаКонтакта.НомерТелефонаБезКодов = СокрЛП(СтрокаТабличнойЧасти.НомерТелефонаБезКодов);
		СтрокаКонтакта.ЗначенияПолей = СтрокаТабличнойЧасти.ДанныеТелефон;

	КонецЕсли;

//	ЭЕКТРОПОЧТА
//	---------------------------------------------------------------------------------------
	СтрокаКонтакта = КонтактнаяИнформацияСлужебный.ПолучитьСтрокуКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации.EmailКонтрагента, КонтрагентОбъект.КонтактнаяИнформация);

	Если ПустаяСтрока(СтрокаТабличнойЧасти.Электропочта) Тогда

		КонтрагентОбъект.КонтактнаяИнформация.Удалить(КонтрагентОбъект.КонтактнаяИнформация.Индекс(СтрокаКонтакта));

	Иначе

		СтрокаКонтакта.Представление = СокрЛП(СтрокаТабличнойЧасти.Электропочта);
		СтрокаКонтакта.АдресЭП       = СокрЛП(СтрокаТабличнойЧасти.Электропочта);

	КонецЕсли;

//	АДРЕС ПОЧТОВЫЙ
//	---------------------------------------------------------------------------------------
	СтрокаКонтакта = КонтактнаяИнформацияСлужебный.ПолучитьСтрокуКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента, КонтрагентОбъект.КонтактнаяИнформация);

	Если ПустаяСтрока(СтрокаТабличнойЧасти.Адрес) Тогда

		КонтрагентОбъект.КонтактнаяИнформация.Удалить(КонтрагентОбъект.КонтактнаяИнформация.Индекс(СтрокаКонтакта));

	Иначе

		СтрокаКонтакта.Страна  = "УКРАИНА";
		СтрокаКонтакта.Область = СокрЛП(СтрокаТабличнойЧасти.Область);
		СтрокаКонтакта.Город   = СокрЛП(СтрокаТабличнойЧасти.Город);

		СтрокаКонтакта.Представление = СтрокаТабличнойЧасти.Адрес;
		СтрокаКонтакта.ЗначенияПолей = СтрокаТабличнойЧасти.ДанныеАдрес;

	КонецЕсли;

//	ДЕТИ
//	---------------------------------------------------------------------------------------
	КонтрагентОбъект.Дети.Очистить();
	УстановитьДанныеРебёнка("1", СтрокаТабличнойЧасти, КонтрагентОбъект.Дети);
	УстановитьДанныеРебёнка("2", СтрокаТабличнойЧасти, КонтрагентОбъект.Дети);
	УстановитьДанныеРебёнка("3", СтрокаТабличнойЧасти, КонтрагентОбъект.Дети);


//	\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\/

	КонтрагентОбъект.ОбменДанными.Загрузка = Истина;
	КонтрагентОбъект.Записать();

КонецПроцедуры

Процедура УстановитьДанныеРебёнка(НомерЗаписи, СтрокаТабличнойЧасти, ТаблицаДети)

	РеквизитИмя  = "ИмяРебенка_" + НомерЗаписи;
	РеквизитПол  = "ПолРебенка_" + НомерЗаписи;
	РеквизитДата = "ДатаРожденияРебенка_" + НомерЗаписи;

	Если НЕ ПустаяСтрока(СтрокаТабличнойЧасти[РеквизитИмя]) Тогда

		ДанныеРебёнка = ТаблицаДети.Добавить();
		ДанныеРебёнка.Имя = СокрЛП(СтрокаТабличнойЧасти[РеквизитИмя]);
		ДанныеРебёнка.ДатаРождения = СтрокаТабличнойЧасти[РеквизитДата];
		ДанныеРебёнка.Пол = СтрокаТабличнойЧасти[РеквизитПол];

		ДанныеРебёнка.Комментарий = "Данные анкетирования";

	КонецЕсли;

КонецПроцедуры
